Repository: parvatisanthosh/SoundSense
Catalog: soundsense/lib/l10n/arb/app_*.arb
Languages: hi

# appTitle
source: Dhwani
hi: ध्वनि

# dashboardGreeting
source: Ready
hi: तैयार

# dashboardListening
source: Listening
hi: सुनाई दे रहा है

# dashboardListeningPrompt
source: Tap microphone to start
hi: शुरू करने के लिए माइक्रोफोन टैप करें

# dashboardPartialListeningPrompt
source: Listening for sounds and speech...
hi: आवाज़ें और भाषण सुन रहा है...

source: Recent Speech
hi: हाल की बातचीत

source: Detected Sounds
hi: पहचानी गई आवाज़ें

# quickActionCaptions
source: Captions
hi: कैप्शन

# quickActionSpeaker
source: Speaker
hi: वक्ता

# quickActionTrain
source: Train
hi: सिखाएं

# quickActionVoices
source: Voices
hi: आवाज़ें

# navHome
source: Home
hi: होम

# navChat
source: Chat
hi: चैट

# navAlerts
source: Alerts
hi: अलर्ट

# navSettings
source: Settings
hi: सेटिंग्स

# settingsTitle
source: Settings
hi: सेटिंग्स

# settingsLanguage
source: Language
hi: भाषा

# settingsDarkMode
source: Dark Mode
hi: डार्क मोड

# chatWelcome
source: Hi! 👋 I'm your SoundSense assistant powered by AI. I can help you understand sounds, answer questions about your environment, or just chat. How can I help you today?
hi: नमस्ते! 👋 मैं AI द्वारा संचालित आपका साउंडसेंस सहायक हूँ। मैं आपको ध्वनियों को समझने, आपके पर्यावरण के बारे में सवालों का जवाब देने, या बस चैट करने में मदद कर सकता हूँ। मैं आज आपकी क्या मदद कर सकता हूँ?

# chatAiAssistant
source: AI Assistant
hi: AI सहायक

# chatStatusOnline
source: Online • Gemini AI
hi: ऑनलाइन • एज़्योर एआई

# chatRecent
source: Recent:
hi: हाल ही में:

# chatInputHint
source: Ask me anything...
hi: मुझसे कुछ भी पूछें...

# chatCleared
source: Chat cleared! 🧹 I'm ready to help you with anything. What would you like to know?
hi: चैट साफ़ की गई! 🧹 मैं आपकी किसी भी चीज़ में मदद करने के लिए तैयार हूँ। आप क्या जानना चाहेंगे?

# notificationsTitle
source: Notifications
hi: सूचनाएं

# notificationsEmpty
source: No notifications yet
hi: अभी कोई सूचना नहीं है

# notificationTimeJustNow
source: Just now
hi: अभी-अभी

# notificationsSpeaker
source: Speaker:
hi: वक्ता:

# trainTitle
source: Teach Dhwani
hi: ध्वनि को सिखाएं

# trainNewSound
source: a new sound
hi: एक नई आवाज़

# trainIdentity
source: SOUND IDENTITY
hi: ध्वनि की पहचान

# trainNameHint
source: e.g. Microwave Beep
hi: उदा. माइक्रोवेव बीप

# trainCategory
source: Category
hi: श्रेणी

# trainCustomSounds
source: Your Custom Sounds
hi: आपकी कस्टम आवाज़ें

# trainStart
source: Start Training
hi: प्रशिक्षण शुरू करें

# trainStep
source: Step
hi: चरण

# trainRecordTitle
source: Record Sample
hi: नमुना रिकॉर्ड करें

# trainRecordSubtitle
source: Capture clear audio of the sound.
hi: ध्वनि का स्पष्ट ऑडियो कैप्चर करें।

# trainReady
source: Ready to record
hi: रिकॉर्ड करने के लिए तैयार

# trainRecording
source: Recording...
hi: रिकॉर्डिंग...

# trainRecord
source: Record
hi: रिकॉर्ड

# trainUpload
source: Upload
hi: अपलोड

# trainListening
source: LISTENING
hi: सुन रहा है

# trainComplete
source: Training complete! 🎉
hi: प्रशिक्षण पूरा हुआ! 🎉

# trainDelete
source: Delete Sound?
hi: क्या ध्वनि हटाएं?

# trainDeleteConfirm
source: This cannot be undone.
hi: इसे पूर्ववत नहीं किया जा सकता।

# trainCancel
source: Cancel
hi: रद्द करें

# trainDeleteAction
source: Delete
hi: हटाएं

# sosTitle
source: Emergency SOS
hi: आपातकालीन SOS

# sosDescription
source: Press the button below to send an emergency alert to all your contacts with your location.
hi: अपने स्थान के साथ अपने सभी संपर्कों को आपातकालीन अलर्ट भेजने के लिए नीचे दिए गए बटन को दबाएं।

# sosSendButton
source: SEND SOS NOW
hi: SOS अभी भेजें

# sosContactsHeader
source: Emergency Contacts
hi: आपातकालीन संपर्क

# sosNoContacts
source: No Contacts Added
hi: कोई संपर्क नहीं जोड़ा गया

# sosAddContactPrompt
source: Add emergency contacts to enable SOS alerts. They will receive your location when you trigger an emergency.
hi: SOS अलर्ट सक्षम करने के लिए आपातकालीन संपर्क जोड़ें। जब आप कोई आपातकालीन स्थिति ट्रिगर करेंगे तो उन्हें आपका स्थान प्राप्त होगा।

# sosAddButton
source: Add Contact
hi: संपर्क जोड़ें

# sosHowItWorks
source: How SOS Works
hi: SOS कैसे काम करता है

# sosStepSound
source: Automatic trigger on critical sounds (siren, alarm)
hi: महत्वपूर्ण ध्वनियों (साायरन, अलार्म) पर स्वचालित ट्रिगर

# sosStepLocation
source: Sends your GPS location
hi: आपका GPS स्थान भेजता है

# sosStepSms
source: SMS sent to all emergency contacts
hi: सभी आपातकालीन संपर्कों को SMS भेजा गया

# sosStepCountdown
source: 10 second countdown to cancel
hi: रद्द करने के लिए 10 सेकंड का लाउंटडाउन

# sosAddContactTitle
source: Add Emergency Contact
hi: आपातकालीन संपर्क जोड़ें

# sosNameLabel
source: Name
hi: नाम

# sosPhoneLabel
source: Phone Number
hi: फ़ोन नंबर

# sosRelationshipLabel
source: Relationship
hi: संबंध

# sosAddContactAction
source: Add Contact
hi: संपर्क जोड़ें

# sosRemoveContactTitle
source: Remove Contact?
hi: संपर्क हटाएं?

# sosRemoveContactConfirm
source: Remove {name} from emergency contacts?
hi: क्या आपातकालीन संपर्कों से {name} को हटाएं?

# sosRemoveAction
source: Remove
hi: हटाएं

# settingsSubtitle
source: Customize your experience
hi: अपने अनुभव को कस्टमाइज़ करें

# settingsSectionSleep
source: SLEEP GUARDIAN
hi: स्लीप गार्डियन

# settingsSectionSound
source: SOUND DETECTION
hi: ध्वनि पहचान

# settingsSectionAlerts
source: ALERTS & HAPTICS
hi: अलर्ट और हैप्टिक्स

# settingsSectionEmergency
source: EMERGENCY
hi: आपातकालीन

# settingsSectionGeneral
source: GENERAL
hi: सामान्य

# settingsAutoSleep
source: Auto Sleep Mode
hi: ऑटो स्लीप मोड

# settingsAutoSleepDisabled
source: Disabled
hi: अक्षम

# settingsAutoSleepScheduled
source: Scheduled: {schedule}
hi: निर्धारित: {schedule}

# settingsActivateSleep
source: Activate Sleep Mode Now
hi: अब स्लीप मोड सक्रिय करें

# settingsDeactivateSleep
source: Deactivate Sleep Mode
hi: स्लीप मोड को निष्क्रिय करें

# settingsSleepModeActivated
source: Sleep mode activated manually
hi: स्लीप मोड मैन्युअल रूप से सक्रिय किया गया

# settingsSchedule
source: Schedule
hi: अनुसूची

# settingsSleepStart
source: Sleep Start
hi: सोने का समय

# settingsWakeUp
source: Wake Up
hi: जागने का समय

# settingsActiveDetection
source: Active Detection
hi: सक्रिय पहचान

# settingsSensitivityLow
source: LOW
hi: कम

# settingsSensitivityHigh
source: HIGH
hi: उच्च

# settingsHaptic
source: Haptic Feedback
hi: हैप्टिक फीडबैक

# settingsHapticDesc
source: Vibrate on detection
hi: पहचान पर कंपन

# settingsVoice
source: Voice Alerts (TTS)
hi: वॉयस अलर्ट (TTS)

# settingsVoiceDesc
source: Speak detected sounds
hi: पहचानी गई आवाज़ें बोलें

# settingsFlash
source: Visual Flash
hi: विजुअल फ्लैश

# settingsFlashDesc
source: Screen flash alerts
hi: स्क्रीन फ्लैश अलर्ट

# settingsEmergencyContacts
source: Emergency Contacts
hi: आपातकालीन संपर्क

# settingsEmergencyContactsDesc
source: Manage SOS contacts
hi: SOS संपर्कों को प्रबंधित करें

# settingsOn
source: On
hi: लागू

# settingsOff
source: Off
hi: बंद

# settingsReset
source: Reset Settings
hi: सेटिंग्स रीसेट करें

# settingsResetDesc
source: Restore default settings
hi: डिफ़ॉल्ट सेटिंग्स पुनर्स्थापित करें

# settingsResetConfirm
source: Are you sure you want to reset all settings to default?
hi: क्या आप सभी सेटिंग्स को डिफ़ॉल्ट पर रीसेट करना चाहते हैं?

# settingsResetAction
source: Reset
hi: रीसेट

# settingsCancelAction
source: Cancel
hi: रद्द करें

# settingsSelectLanguage
source: Select Language
hi: भाषा चुनें

# settingsLanguageHindi
source: Hindi
hi: हिंदी

# settingsLanguageEnglish
source: English
hi: अंग्रेज़ी

# settingsModeSystem
source: System Default
hi: सिस्टम डिफ़ॉल्ट

# settingsModeLight
source: Light Mode
hi: लाइट मोड

# settingsModeDark
source: Dark Mode
hi: डार्क मोड

# settingsSleepStartsIn
source: Starts in {time}
hi: {time} में शुरू होगा

# settingsSleepEndsIn
source: Ends in {time}
hi: {time} में समाप्त होगा

# sosCountSeconds
source: seconds until SOS is sent
hi: SOS भेजे जाने तक सेकंड

# sosDetectedSounds
source: Detected Sounds
hi: पहचानी गई आवाज़ें

# sosTapCancel
source: TAP TO CANCEL
hi: रद्द करने के लिए टैप करें

# sosCancelQuote
source: I'm okay, cancel the alert
hi: मैं ठीक हूँ, अलर्ट रद्द करें

# sosSentTitle
source: SOS SENT
hi: SOS भेज दिया गया

# sosNotified
source: contact(s) notified
hi: संपर्क(कों) को सूचित किया गया

# sosSentMessage
source: Your emergency contacts have been sent your location. Help is on the way.
hi: आपके आपातकालीन संपर्कों को आपका स्थान भेज दिया गया है। मदद रास्ते में है।

# sosSafe
source: I AM SAFE
hi: मैं सुरक्षित हूँ

# sosCallEmergency
source: Call Emergency Services (112)
hi: आपातकालीन सेवाओं को कॉल करें (112)

# dashboardManualSosTitle
source: Manual SOS
hi: मैनुअल SOS

# dashboardManualSosContent
source: Send emergency alert to all contacts?
hi: सभी संपर्कों को आपातकालीन अलर्ट भेजें?

# dashboardManualSosAction
source: Send SOS
hi: SOS भेजें

# dashboardSleepGuardianTitle
source: Sleep Guardian
hi: स्लीप गार्डियन

# dashboardSleepGuardianContent
source: Activate Sleep Guardian mode? This will monitor for critical sounds while you sleep.
hi: स्लीप गार्डियन मोड सक्रिय करें? यह आपके सोते समय महत्वपूर्ण आवाज़ों की निगरानी करेगा।

# dashboardSleepGuardianAction
source: Activate
hi: सक्रिय करें

# dashboardStopListeningFirst
source: ⚠️ Stop listening first
hi: ⚠️ पहले सुनना बंद करें

# spkTitle
source: Speaker Recognition
hi: वक्ता की पहचान

# spkServerUnavailable
source: Server not available
hi: सर्वर उपलब्ध नहीं है

# spkMicDenied
source: Microphone permission denied
hi: माइक्रोफ़ोन अनुमति अस्वीकृत

# spkUnknown
source: Unknown
hi: अज्ञात

# spkUnknownSpeaker
source: Unknown speaker
hi: अज्ञात वक्ता

# spkFailed
source: Recognition failed
hi: पहचान विफल रही

# spkConnectError
source: Cannot connect to server
hi: सर्वर से कनेक्ट नहीं हो सकता

# spkRetry
source: Retry
hi: पुनः प्रयास करें

# spkIdentify
source: Identify Speaker
hi: वक्ता को पहचानें

# spkRecording
source: Recording (4s)...
hi: रिकॉर्डिंग (4s)...

# spkAddMember
source: Add Family Member
hi: परिवार के सदस्य को जोड़ें

# spkHowTo
source: How to use:
hi: उपयोग कैसे करें:

# spkInstruction1
source: 1. First, add family members using "Add Family Member"
hi: 1. सबसे पहले, "परिवार के सदस्य को जोड़ें" का उपयोग करके परिवार के सदस्यों को जोड़ें

# spkInstruction2
source: 2. Then tap "Identify Speaker" to recognize who's talking
hi: 2. फिर यह पहचानने के लिए "वक्ता को पहचानें" टैप करें कि कौन बात कर रहा है

# spkInstruction3
source: 3. The app will record for 3 seconds
hi: 3. ऐप 3 सेकंड के लिए रिकॉर्ड करेगा

# feedbackCorrect
source: Correct
hi: सही

# feedbackWrong
source: Wrong
hi: गलत

# feedbackDismiss
source: Dismiss (Don't show again)
hi: खारिज करें (फिर न दिखाएं)

# feedbackTrain
source: Train This Sound
hi: इस ध्वनि को सिखाएं

# feedbackThanks
source: ✓ Thanks! I'll remember this
hi: ✓ धन्यवाद! मैं इसे याद रखूंगा

# feedbackNoted
source: ✓ Noted! I'll improve
hi: ✓ नोट किया गया! मैं सुधार करूंगा

# sosSentSuccess
source: ✓ SOS Sent!
hi: ✓ SOS भेजा गया!

# dashboardStatusSounds
source: {count} sounds
hi: {count} आवाज़ें

# dashboardStatusTranscripts
source: {count} transcripts
hi: {count} लिप्यंतरण

# voiceProfileTitle
source: Voice Profiles
hi: आवाज़ प्रोफाइल

# voiceProfileNameLabel
source: Person's Name
hi: व्यक्ति का नाम

# voiceProfileNameHint
source: e.g., Mom, Dad, John
hi: उदा. माँ, पिताजी, राहुल

# voiceProfileRelationshipLabel
source: Relationship
hi: रिश्ता

# voiceProfileCreateButton
source: Create Voice Profile
hi: वॉयस प्रोफाइल बनाएं

# voiceProfileSavedTitle
source: Saved Profiles
hi: सहेजे गए प्रोफाइल

# voiceProfileAddAnother
source: Add Another Person
hi: एक और व्यक्ति जोड़ें

# voiceProfileTraining
source: Training
hi: प्रशिक्षण

# voiceProfileProgress
source: Progress
hi: प्रगति

# voiceProfileEnrolled
source: Enrolled
hi: नामांकित

# voiceProfileReady
source: Ready
hi: तैयार

# voiceProfilePending
source: Pending
hi: लंबित

# voiceProfileInstructions
source: Ask {name} to speak naturally for {seconds} seconds in a quiet environment.
hi: {name} से शांत वातावरण में {seconds} सेकंड के लिए स्वाभाविक रूप से बोलने को कहें।

# voiceProfileSuccess
source: Voice profile saved! This person can now be identified during live captions.
hi: वॉयस प्रोफाइल सहेजा गया! अब इस व्यक्ति को लाइव कैप्शन के दौरान पहचाना जा सकता है।

# transcriptionTitle
source: Dhwani Live
hi: ध्वनि लाइव

# transcriptionReady
source: Ready to listen
hi: सुनने के लिए तैयार

# transcriptionListening
source: Listening now
hi: अब सुन रहा है

# transcriptionPrompt
source: Tap microphone to start
hi: शुरू करने के लिए माइक्रोफोन टैप करें

# transcriptionRecent
source: Recent Captions
hi: हाल के कैप्शन

# transcriptionClear
source: Clear
hi: साफ़ करें

# transcriptionEmpty
source: No captions yet
hi: अभी तक कोई कैप्शन नहीं

# transcriptionMute
source: Mute
hi: म्यूट

# transcriptionSize
source: Size
hi: आकार

# transcriptionSave
source: Save
hi: सहेजें

# relMom
source: Mom
hi: माँ

# relDad
source: Dad
hi: पिताजी

# relSister
source: Sister
hi: बहन

# relBrother
source: Brother
hi: भाई

# relSpouse
source: Spouse
hi: जीवनसाथी

# relChild
source: Child
hi: बच्चा

# relFriend
source: Friend
hi: मित्र

# relColleague
source: Colleague
hi: सहकर्मी

# relDoctor
source: Doctor
hi: डॉक्टर

# relOther
source: Other
hi: अन्य
